## Pandas Filtering Practice

In this practice, we will explore data on the progression of salaries of students graduating from various schools. The file "salaries-by-region.csv" gives this information broken down by region and the the file "salaries-by-college-type.csv" gives this information broken by school type.

In [2]:
def Get_Dict_Region(file_location):
    
    """Take as input the file location of salaries-by-region.csv
    and returns a dictionary with a key for each school whose value is the region
    of that school."""
    
    df_region = pd.read_csv(file_location)
    
    #Write your code here

    D_region = {}

    return D_region

$--------------------------------------------------$

Write the function Get_Dict_Region, which reads the file "salaries-by-region.csv" into a dataframe called df_region and then uses iterrows() to construct a dictionary where there is a key for each school and it's value is the region.  Return this dictionary.

In [3]:
import pandas as pd

file_location = "Data/salaries-by-region.csv"
D_regions = Get_Dict_Region(file_location)

Read in the file "salaries-by-college-type.csv" into a a dataframe called df_college_type and use dtype to check the how each column is stored. Use "N/A" as the na_values when you read in the dataframe.

In [27]:
#Write your code here
df = pd.read_csv('Data/salaries-by-college-type.csv', na_values=['N/A'])
df.head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00","$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,Engineering,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"Polytechnic University of New York, Brooklyn",Engineering,"$62,400.00","$114,000.00","$66,800.00","$94,300.00","$143,000.00","$190,000.00"
4,Cooper Union,Engineering,"$62,200.00","$114,000.00",NaN,"$80,200.00","$142,000.00",NaN

We need notice that all of the salary categories are objects when they should be ints. Use a for loop over the columns attribute of the dataframe df_college_type and a  map function to do the conversion of each of these columns to a float.

In [30]:
#Write your code here
def str_to_num(a):
    if type(a) != str:
        return a
    return pd.to_numeric(a.replace('$', '').replace(',', ''))

# df['Starting Median Salary'] = df['Starting Median Salary'].apply(str_to_num)
# df['Mid-Career Median Salary'] = df['Mid-Career Median Salary'].apply(str_to_num)
# df['Mid-Career 10th Percentile Salary'] = df['Mid-Career 10th Percentile Salary'].apply(str_to_num)
# df['Mid-Career 25th Percentile Salary'] = df['Mid-Career 25th Percentile Salary'].apply(str_to_num)
# df['Mid-Career 75th Percentile Salary'] = df['Mid-Career 75th Percentile Salary'].apply(str_to_num)
# df['Mid-Career 90th Percentile Salary'] = df['Mid-Career 90th Percentile Salary'].apply(str_to_num)
# df.head()

for colname in df.columns[2:]:
    df[colname] = df[colname].apply(str_to_num)
    
df.head()

# can us fillna() to deal with NaN

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),Engineering,72200.0,126000.0,76800.0,99200.0,168000.0,220000.0
1,California Institute of Technology (CIT),Engineering,75500.0,123000.0,NaN,104000.0,161000.0,NaN
2,Harvey Mudd College,Engineering,71800.0,122000.0,NaN,96000.0,180000.0,NaN
3,"Polytechnic University of New York, Brooklyn",Engineering,62400.0,114000.0,66800.0,94300.0,143000.0,190000.0
4,Cooper Union,Engineering,62200.0,114000.0,NaN,80200.0,142000.0,NaN

Then use map and a lambda function to add a column for region.

In [ ]:
#Write you code here

How many colleges are represented?

In [31]:
#Write your code here
df['School Name'].nunique()

249

How many school-dept pairs have a starting salary greater than 65K?

In [34]:
#Write your code here
df.loc[df['Starting Median Salary'] >= 65000].shape

(4, 8)

What is the average median starting salary among these schools?

In [38]:
#Write your code here
df.loc[df['Starting Median Salary'] >= 65000, 'Starting Median Salary'].mean()

71500.0

What is the median mid career 75th percentile salary of party schools in a Southern or Western region?

In [ ]:
#Write your code here

What fraction of California schools have a starting median starting salary above 50K?

In [ ]:
#Write your code here